reading-notes/data-engineering/fowler-monolith-to-mesh.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2021-09-05 Sun 16:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-">Summary</a></li>
<li><a href="#sec-">introduction</a></li>
<li><a href="#sec-">the current enterprise data platform architecture</a></li>
<li><a href="#sec-">Architecture failure modes</a></li>
<li><a href="#sec-">The next enterprise data platform architecture</a></li>
<li><a href="#sec-">Data as a product</a>
<ul class="nav">
<li><a href="#sec-">Discoverable</a></li>
<li><a href="#sec-">Trustworthy and truthful</a></li>
<li><a href="#sec-">Self-describing semantics and syntax</a></li>
<li><a href="#sec-">Inter-operable and governed by global standards</a></li>
<li><a href="#sec-">Secure and governed by a global access control</a></li>
</ul>
</li>
<li><a href="#sec-">Domain data cross-functional teams</a></li>
<li><a href="#sec-">Data and self-serve platform design convergence</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Summary</h2>
<div class="outline-text-2" id="text-">
<p>
(╯°□°）╯︵ ǝsnoɥǝɹɥɐʍ ɐʇɐp
</p>

<p>
(╯°□°）╯︵ ǝʞɐl ɐʇɐp
</p>

<p>
decentralize ノ( º _ ºノ)
</p>

<ul class="org-ul">
<li>serving over ingesting
</li>
<li>discovering and using over extracting and loading
</li>
<li>Publishing events as streams over flowing data around via centralized pipelines
</li>
<li>Ecosystem of data products over centralized data platform
</li>
</ul>

<p>
Original source: <a href="https://martinfowler.com/articles/data-monolith-to-mesh.html">https://martinfowler.com/articles/data-monolith-to-mesh.html</a> , 14.11.2019
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">introduction</h2>
<div class="outline-text-2" id="text-">
<p>
Datalakes are a common architecture pattern, idea is to 
democratize data access to enable buisiness insights and decision making.
</p>

<p>
This has some failure modes, mainly because of the monolythic base design,
need shift to decentralized architectures, utilizing domain driven design and platform thinking.
</p>

<p>
"Data as product."
</p>

<p>
Intelligent empowerment brings much value, but despite heavy investments, 
the return is small in many enterprises.
</p>

<p>
Challenges are competing buisiness prioritys and legacy systems/thinking,
plus architectural failure modes.
</p>

<p>
To remedy against architectural failures, this article provides the definition of a <i>data mesh</i>.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">the current enterprise data platform architecture</h2>
<div class="outline-text-2" id="text-">
<p>
The classical DWH / ETL stack underutilizes potential, as it incurs tech debt and is only 
usable by a small number of people 
</p>

<p>
Data lake is again problematic because it's operated by a small number of people, and they follow a 
"build it; they will come" mentality =&gt; store everything that could be useful <a href="https://www.thoughtworks.com/insights/blog/curse-data-lake-monster">(source)</a>  
</p>

<p>
Related: <a href="https://martinfowler.com/bliki/Datensparsamkeit.html">Datensparsamkeit</a>
</p>

<p>
The <i>current</i> generation of data architecture is something in the direction
of kappa, bash &amp; stream unified (Beam) and utilizing cloud services.
</p>
</div>
</div>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Architecture failure modes</h2>
<div class="outline-text-2" id="text-">
<p>
<span class="underline">First failure mode: doesn't scale.</span>
</p>

<p>
Even though <i>domain driven design</i> has been successfully applied for enterprise architectures,
this has been disregarded for data.
</p>

<p>
That might work for small enterprises, but but doesn't scale for rich domain structures and many
producers/consumers.
</p>

<p>
Another problem is that <i>ownerships are seperated</i>, incurring a long response time to satisfy
a data consumers need.
</p>

<p>
<span class="underline">Second failure mode: architecture is wrongly decomposed.</span>
</p>

<p>
It is ideal to seperate into architectural <i>quanta</i>, meaning independently deployable
and single responsibility.
</p>

<p>
But sometimes data processing pipelines are decomposed into pipelines where every 
pipeline step is thought to be a <i>quanta</i>. That is wrong becase there are still a lot of
dependency horizontally.
</p>

<p>
So the quantum here is everything that changes when a new dataset gets integrated and provided
for consumers.
</p>

<p>
<span class="underline">Third failure mode: silo governance of the data platform</span>
</p>

<p>
Data engineers are seperated by their big data tooling expertise and lack domain knowledge.
This organizational setup leaves no incentive for producer teams to create high quality
data, and the data engineers can not serve the consumers optimally because of lack of domain knowledge.
</p>

<p>
This puts a sad face on the cosumer and data engineering team :(..
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">The next enterprise data platform architecture</h2>
<div class="outline-text-2" id="text-">
<p>
Is it a bird? Is it a plane? No it's a \Data Mesh\!
</p>

<p>
Buzzwords: Distributed Domain Driven Architecture, Self-serve Platform Design, and Product Thinking with Data.
</p>

<p>
(Side note: <a href="https://domainlanguage.com/ddd/">this</a> seems to be a good book about DDD)
</p>

<p>
DDD is usually only applied until the <i>ingestion boundary</i> by having producing
teems emit their Domain Events.
</p>

<p>
A good summary of the underlying problem is <a href="https://www.confluent.io/blog/data-dichotomy-rethinking-the-way-we-treat-data-and-services/">Data Dichotomy</a>: 
"Data systems are about exposing data. Services are about hiding it."
</p>

<p>
A solution to this dichotomy is that 
"domains need to host and serve their domain datasets in an easily consumable way."
</p>

<p>
In essence we need to move from push and ingest, to serving and pull.
</p>

<p>
In reality, data comes from all kinds of system into what fowler calls
"reality dataset" or source aligned dataset. 
</p>

<p>
So a team owning a domain can own multiple "reality" datasets, 
and it's the teams responsibility to publish domain aligned datasets (also called "Source domain datasets") out of these (on a Stream,
for anyone to consume).
</p>

<p>
Then there are also consumer datasets, they are aggreageted from source domain datasets, 
and are made to fit for specific consumer domains. They must be possible to regenerate from source.
</p>

<p>
This allows to seperate pipeline stages into domains.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Data as a product</h2>
<div class="outline-text-2" id="text-">
<p>
Product thinking has been successfully applied to API's: Teams strive to create the best 
experience for the API's they offer, in order to create higher value in the organization.
The same needs to happen with datasets.
</p>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Discoverable</h3>
<div class="outline-text-3" id="text-">
<p>
When data is published, it should be documented in a centralized metadata registry
</p>
</div>
</div>
<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Trustworthy and truthful</h3>
<div class="outline-text-3" id="text-">
<p>
Producers need to define service level objectives. E.g. "this data is realtime but counts
can be inaccurate sometimes" or "this data appears with 2 min accuracy and is deduplicated&#x2026;".
Responsibility of data cleansing moves from data lake to producers &rarr; paradigm shift.
</p>
</div>
</div>
<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Self-describing semantics and syntax</h3>
<div class="outline-text-3" id="text-">
<p>
Meaning of data, schema and ideally example data items need to be provided, so the consumption
can happen without any communication between producer and consumer teams.
</p>
</div>
</div>
<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Inter-operable and governed by global standards</h3>
<div class="outline-text-3" id="text-">
<p>
Source domain datasets (raw event stream), should enforce global standards for naming, data formatting
and normalization
</p>
</div>
</div>
<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Secure and governed by a global access control</h3>
<div class="outline-text-3" id="text-">
<p>
Datasets have to be secure and access-restricted by SSO or role based access.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Domain data cross-functional teams</h2>
<div class="outline-text-2" id="text-">
<p>
This paradigm shift comes with a need for data engineers and a data product owner in product teams.
</p>

<p>
The <i>data product owner</i> is like a PO for end-consumer facing products, just that the 
consumer in this case are other teams in the organization. (Preferred pronoun) takes 
roadmap decisions with respect to data products, and measures KPI's such as time to discovery
of a dataset.
</p>

<p>
Need for data engineers in such teams is obvious, this has the good side effect that 
engineers and data engineers can learn from each other.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Data and self-serve platform design convergence</h2>
<div class="outline-text-2" id="text-">
<p>
Thats all fine and dandy, but how do we avoid duplicated efforts in infrastructure/tooling?
The solution is again something that has been proven sucessful before: Platform thinking.
</p>

<p>
A team of data infra engineers is responsible to provide self-service domain-agnostic infra. 
This encludes many things, from providing a common streaming platform to encryption services,
lineage tracking and caching to name a few.
</p>

<p>
Should measure lead time until new data product goes live as metric.
</p>
</div>
</div>
</div></div></div>
</body>
</html>
